https://github.com/okovtun/VBU_221.git
https://www.youtube.com/watch?v=_qb0nIzcEXM&list=PLeqyOOqxeiINUveaBPm5nxiv0F_CFRGve

https://www.cplusplus.com/
https://en.cppreference.com/w/

TODO:
1. С клавиатуры вводится число, программа вычисляет факториал этого числа;
2. При помщи цикла for возвести число в степень.
   Показатель степени может быть как положительным, так и отрицательным;
3. Вывести на экран таблицу ASCII-символов по 16 символов в строке;
4. Вывести на экран ряд Фибоначчи, до числа, введенного с клавиатуры;
5. Вывести на экран заданное количество чисел из ряда Фибоначчи;
-----------------------------------------------------------------
6. Вывести на экран таблицу умножения;
7. Вывести на экран таблицу Пифагора;
8. Вывести на экран ряд простых чисел до указанного с клавиатуры;

DONE:
1. Пользователь вводит с клавиатуры число. Если введенное число попадает в диапазон 
   от 0 до 10, программа выводит: "Цель поражена", в противном случае - "Вы промахнулись";
2. Написать программу "Калькулятор", который вычисляет выражения вида: 2+3
	2 + 3 = 5;
------------------------
3. Пользователь вводит число с клавиатуры. 
   Программа должна сказать, введенное число - палиндром, или не палиндром.
   12321 - палиндром
   121 - палиндром
   123 - НЕ палиндром
4. Пользователь вводит с клавиатуры номер автобусного билета.
   Программа должна сказать билет счастливый или обычный.
   123123 - счастливый
   123456 - обычный
5. Написать программу 3Dshooter, которая по нажатой клавише выводит на экран DONE
   действие:
   w - вперед
   s - назад
   a - влево
   d - вправо
   Space - прыжок
   Enter - огонь
   Shooter должен быть регистронезависимым и 
   перемещение так же должно работать через клавиши курсора (стрелки).
------------------------------------------------------------------------

1. С клавиатуры вводится число, программа вычисляет факториал этого числа;
2. При помщи цикла for возвести число в степень.
   Показатель степени может быть как положительным, так и отрицательным;
3. Вывести на экран таблицу ASCII-символов по 16 символов в строке;

========================================================================

DONE:
1. Поменять местами две переменные;
2. Используя оператор typeid() выяснить типы следующих значений:
	5;
	5.;
	.5;
	5.f;
	8ULL;
	'+';
3. Что будет выведено на экран:
	int i=3;
	i = ++i + ++i;
	cout << i << endl;
4. Что будет выведено на экран:
	int i=3;
	i = ++i + 1 + ++i*2;
	cout << i << endl;
5. Что будет выведено на экран:
	int i=3;
	i = ++i + 1 + ++i*=2;
	cout << i << endl;
6. Что будет выведено на экран:
	int i = 3;
	i += ++i + 1 + ++i*=2;
	cout << i << endl;
7. Что будет выведено на экран:
	int i=3;
	i *= ++i + 1 + ++i+=2;
	cout << i << endl;



DONE:
1. Вывести в консоль стишок "В лесу родилась Ёлочка".
   Стишок должен быть выровнен по середине экрана,
   и его куплеты должны быть разделены пустой строкой.
2. Изучить теорию из этих файлов:
	https://github.com/okovtun/VBU_221/blob/master/DataTypes/NumericSystems.pdf
	https://github.com/okovtun/VBU_221/blob/master/DataTypes/DataTypes.pdf
3. Решить задачи: https://github.com/okovtun/VBU_221/blob/master/DataTypes/VariablesTask.pdf
   Для решения этих задач понадобится cin.